app/controllers/products_controller.rb

  def index
    @products = Product.all
---
SELECT * FROM "products"

  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("created_at", "title", "image_url", "updated_at", "description") VALUES('2010-12-24 14:43:10', 'Droga Cienia ', '', '2010-12-24 14:43:10', '<p>

  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])
---
SELECT * FROM "products" WHERE ("products"."id" = 1)
UPDATE "products" SET "updated_at" = '2010-12-24 14:43:38', "image_url" = '/obrazki/okladka-450.jpg' WHERE "id" = 1