app/controllers/store_controller.rb

  def save_order
          @order = Order.new(params[:order])
          @order.add_line_items_from_cart(@cart)
          if @order.save
---
INSERT INTO "line_items" ("created_at", "product_id", "quantity", "order_id", "total_price", "updated_at") VALUES('2010-12-26 23:49:19', 2, 1, 1, 29.95, '2010-12-26 23:49:19')
INSERT INTO "orders" ("name", "address", "created_at", "updated_at", "pay_type", "email") VALUES('Rafal', 'niema adresu', '2010-12-26 23:49:19', '2010-12-26 23:49:19', 'cc', 'costamcostam')

  def delete_from_cart
        begin
          product = Product.find(params[:id])
---
SELECT * FROM "products" WHERE ("products"."id" = 0)