app/controllers/users_controller.rb

SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
---
  def index
    @users = User.find(:all, :order => :name)

SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
---
  def show
    @user = User.find(params[:id])

INSERT INTO "users" ("name", "salt", "created_at", "updated_at", "hashed_password") VALUES('rafal', '-6143366080.169782705104457', '2010-12-27 20:17:32', '2010-12-27 20:17:32', '799e765ef932204a60111151d08dd85b855bcb2e')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT * FROM "users" WHERE ("users"."id" = 2) LIMIT 1
UPDATE "users" SET "updated_at" = '2010-12-27 22:55:33', "salt" = '-6141579680.151199526426462', "hashed_password" = 'b707cbea0dadd84f97b7c807731c1b348e76b1bf' WHERE "id" = 2
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])

SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
DELETE FROM "users" WHERE "id" = 1
---
  def destroy
    @user = User.find(params[:id])
    begin
            flash[:notice] = "User #{@user.name} deleted"
            @user.destroy